import Container from "react-bootstrap/Container"
import TagCloud from "./TagCloud"
import { useState } from "react"
import './styles.css'


const tagText = {
    "Тривожність": "Психологічний стан, який виникає внаслідок поєднання різних фізіологічних, кoгнітивних та емоційних реакцій на загрозу або невизначеність в майбутньому. Тривожність може бути корисною в певних ситуаціях, оскільки активує захисну реакцію організму, проте, коли вона стає надмірною та заважає повсякденному життю, це може свідчити про тривожний розлад. Тривожність може бути керована та лікувана різними методами, включаючи психотерапію, медикаментозну терапію і техніки стрес-менеджменту.",
    "Стресс": "Фізіологічна та психологічна реакція організму на подразники або негативні ситуації, які вимагають адаптації чи реакції. Стрес може виникати внаслідок різних подій, таких як робочі труднощі, особисті проблеми, фізичне навантаження, надмірні обов'язки, конфлікти, загрози та інші фактори. Ефективне керування стресом включає в себе різні стратегії, такі як релаксація, медитація, фізична активність, правильне харчування, встановлення гармонійного робочого та особистого життя, а також шукання підтримки від друзів, родини чи професійного психолога або психіатра, якщо стрес стає хронічним і важким.",
    "Дистрес": "Тип стресу, який виникає внаслідок негативних ситуацій, подій або досвідів, і може мати шкідливий вплив на фізичне і психологічне здоров'я людини. Симптоми дистресу можуть включати тривогу, депресію, роздратованість, безсоння, зміни апетиту, збільшене серцебиття, головні болі, м'язову напругу, втому та інші фізичні та психологічні прояви. Якщо дистрес стає довготривалим і неадекватним реакціям на ситуації, то це може призвести до серйозних проблем зі здоров'ям, включаючи психічні розлади.",
    "Залежність": "Стан, коли людина втрачає контроль над певною поведінкою чи речовиною та відчуває потребу у постійному її вживанні або використанні, не зважаючи на можливі негативні наслідки для здоров'я, відносин, роботи або інших сфер життя. Залежність може виникати від різних речовин (наприклад, алкоголь, наркотики, тютюн), від певних видів поведінки (наприклад, азартні ігри, споживання їжі, комп'ютерні ігри, покупки) або від психологічних станів (наприклад, залежність від стосунків, релігійна залежність).",
    "Самооцінка": `Сприйняття та оцінка власного внутрішнього "я", характеристик, здібностей, цінностей та досягнень. Вона грає важливу роль у формуванні нашої самосвідомості і впливає на наше поведінку, емоційний стан та взаємодію з іншими людьми. Самооцінка може бути формована різними факторами, такими як досвід, виховання, соціальне середовище, психологічні стани і взаємодія з іншими людьми. Це процес, який триває протягом усього життя, і важливо розвивати позитивну та здорову самооцінку, спрямовану на підтримку психологічного і емоційного благополуччя.`,
    "Депресія": "Психічний розлад, який виявляється в тривожному, пригніченому настрої, втраті інтересу до життя та задоволення від нього, втраті енергії і низці фізичних і психологічних симптомів. Депресія може впливати на різні аспекти життя людини і важливо її вчасно визнати і лікувати. Депресія може бути спричинена різними факторами, включаючи генетичні, біологічні, соціальні та психологічні. Лікування може включати в себе психотерапію, медикаментозну терапію або їх комбінацію. Депресія може бути лікувана, і з правильною підтримкою і допомогою від фахівців багато людей можуть повернутися до нормального життя і відчувати себе краще.",
    "Паніка": "Інтенсивний психологічний стан, який включає в себе велику тривожність, страх і фізіологічні реакції, такі як швидке серцебиття, підвищений артеріальний тиск, плескіть, позбавлення дихання, підвищений потовиділення та дратівливість. Паніка може виникати раптово і призводити до відчуття втрати контролю. Панічні атаки можуть виникати внаслідок стресу, тривожності, деяких фобій, але також можуть мати генетичні або біологічні причини. Люди, які страждають від повторюваних панічних атак, можуть розвивати панічний розлад.",
    "Відносини": "Взаємодія і взаємозв'язки між людьми у різних сферах життя, таких як особисті, родинні, професійні, дружні тощо. Вони можуть бути різноманітними за своєю природою і динамікою, а також можуть розвиватися в різні способи. Важливо пам'ятати, що відносини є динамічним процесом, і вони вимагають часу, зусиль та розвитку. Кожна пара чи група людей має свої унікальні особливості та виклики, і навчання як ефективно взаємодіяти і підтримувати відносини може бути корисним для досягнення більш задовільного і здорового життя."
}



export default function Details(){
    const [activeTag, setActiveTag] = useState(null)
    
    return (
        <Container style={{backgroundColor: "#f4f4f4", height: "fit-content", minHeight: "100vh"}} className="p-0 d-flex flex-column align-items-center" fluid>
            <Container className="py-5 px-0">
                <h1 className="m-0 pt-5 pb-md-5 pb-3 text-center text-dark text-justify">
                    Спектр спеціалізації
                </h1>
            </Container>
            <Container style={{height: "25vh"}} className="p-0 d-flex flex-column align-items-center " fluid>
                <TagCloud
                    setActiveTag={setActiveTag} 
                />
            </Container>
            <Container style={{height: "fit-content", minHeight: "20vh"}} className="mt-md-5 mt-3 p-0">
                {activeTag ?
                    <p className="m-0 px-md-5 px-3 pb-5 text-muted fs-5 text-justify tagcloud-text">
                        {tagText[activeTag]}
                    </p>
                    :
                    <></>
                }
            </Container>
        </Container>    
    )
}